FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1766.h
#define FIO3MASK1 (*(volatile unsigned char *)0x2009C071)
#define FIO3MASK1_OFFSET 0x71

#define FIO3MASK2 (*(volatile unsigned char *)0x2009C072)
#define FIO3MASK2_OFFSET 0x72

#define FIO3MASK3 (*(volatile unsigned char *)0x2009C073)
#define FIO3MASK3_OFFSET 0x73

#define FIO3MASKL (*(volatile unsigned short *)0x2009C070)
#define FIO3MASKL_OFFSET 0x70

#define FIO3MASKU (*(volatile unsigned short *)0x2009C072)
#define FIO3MASKH FIO3MASKU
#define FIO3MASKU_OFFSET 0x72
#define FIO3MASKH_OFFSET FIO3MASKU_OFFSET

#define FIO4MASK (*(volatile unsigned long *)0x2009C090)
#define FIO4MASK_OFFSET 0x90

#define FIO4MASK0 (*(volatile unsigned char *)0x2009C090)
#define FIO4MASK0_OFFSET 0x90

#define FIO4MASK1 (*(volatile unsigned char *)0x2009C091)
#define FIO4MASK1_OFFSET 0x91

#define FIO4MASK2 (*(volatile unsigned char *)0x2009C092)
#define FIO4MASK2_OFFSET 0x92

#define FIO4MASK3 (*(volatile unsigned char *)0x2009C093)
#define FIO4MASK3_OFFSET 0x93

#define FIO4MASKL (*(volatile unsigned short *)0x2009C090)
#define FIO4MASKL_OFFSET 0x90

#define FIO4MASKU (*(volatile unsigned short *)0x2009C092)
#define FIO4MASKH FIO4MASKU
#define FIO4MASKU_OFFSET 0x92
#define FIO4MASKH_OFFSET FIO4MASKU_OFFSET

#define FIO0PIN (*(volatile unsigned long *)0x2009C014)
#define FIO0PIN_OFFSET 0x14

#define FIO0PIN0 (*(volatile unsigned char *)0x2009C014)
#define FIO0PIN0_OFFSET 0x14

#define FIO0PIN1 (*(volatile unsigned char *)0x2009C015)
#define FIO0PIN1_OFFSET 0x15

#define FIO0PIN2 (*(volatile unsigned char *)0x2009C016)
#define FIO0PIN2_OFFSET 0x16

#define FIO0PIN3 (*(volatile unsigned char *)0x2009C017)
#define FIO0PIN3_OFFSET 0x17

#define FIO0PINL (*(volatile unsigned short *)0x2009C014)
#define FIO0PINL_OFFSET 0x14

#define FIO0PINU (*(volatile unsigned short *)0x2009C016)
#define FIO0PINH FIO0PINU
#define FIO0PINU_OFFSET 0x16
#define FIO0PINH_OFFSET FIO0PINU_OFFSET

#define FIO1PIN (*(volatile unsigned long *)0x2009C034)
#define FIO1PIN_OFFSET 0x34

#define FIO1PIN0 (*(volatile unsigned char *)0x2009C034)
#define FIO1PIN0_OFFSET 0x34

#define FIO1PIN1 (*(volatile unsigned char *)0x2009C035)
#define FIO1PIN1_OFFSET 0x35

#define FIO1PIN2 (*(volatile unsigned char *)0x2009C036)
#define FIO1PIN2_OFFSET 0x36

#define FIO1PIN3 (*(volatile unsigned char *)0x2009C037)
#define FIO1PIN3_OFFSET 0x37

#define FIO1PINL (*(volatile unsigned short *)0x2009C034)
#define FIO1PINL_OFFSET 0x34

#define FIO1PINU (*(volatile unsigned short *)0x2009C036)
#define FIO1PINH FIO1PINU
#define FIO1PINU_OFFSET 0x36
#define FIO1PINH_OFFSET FIO1PINU_OFFSET

#define FIO2PIN (*(volatile unsigned long *)0x2009C054)
#define FIO2PIN_OFFSET 0x54

#define FIO2PIN0 (*(volatile unsigned char *)0x2009C054)
#define FIO2PIN0_OFFSET 0x54

#define FIO2PIN1 (*(volatile unsigned char *)0x2009C055)
#define FIO2PIN1_OFFSET 0x55

#define FIO2PIN2 (*(volatile unsigned char *)0x2009C056)
#define FIO2PIN2_OFFSET 0x56

#define FIO2PIN3 (*(volatile unsigned char *)0x2009C057)
#define FIO2PIN3_OFFSET 0x57

#define FIO2PINL (*(volatile unsigned short *)0x2009C054)
#define FIO2PINL_OFFSET 0x54

#define FIO2PINU (*(volatile unsigned short *)0x2009C056)
#define FIO2PINH FIO2PINU
#define FIO2PINU_OFFSET 0x56
#define FIO2PINH_OFFSET FIO2PINU_OFFSET

#define FIO3PIN (*(volatile unsigned long *)0x2009C074)
#define FIO3PIN_OFFSET 0x74

#define FIO3PIN0 (*(volatile unsigned char *)0x2009C074)
#define FIO3PIN0_OFFSET 0x74

#define FIO3PIN1 (*(volatile unsigned char *)0x2009C075)
#define FIO3PIN1_OFFSET 0x75

#define FIO3PIN2 (*(volatile unsigned char *)0x2009C076)
#define FIO3PIN2_OFFSET 0x76

#define FIO3PIN3 (*(volatile unsigned char *)0x2009C077)
#define FIO3PIN3_OFFSET 0x77

#define FIO3PINL (*(volatile unsigned short *)0x2009C074)
#define FIO3PINL_OFFSET 0x74

#define FIO3PINU (*(volatile unsigned short *)0x2009C076)
#define FIO3PINH FIO3PINU
#define FIO3PINU_OFFSET 0x76
#define FIO3PINH_OFFSET FIO3PINU_OFFSET

#define FIO4PIN (*(volatile unsigned long *)0x2009C094)
#define FIO4PIN_OFFSET 0x94

#define FIO4PIN0 (*(volatile unsigned char *)0x2009C094)
#define FIO4PIN0_OFFSET 0x94

#define FIO4PIN1 (*(volatile unsigned char *)0x2009C095)
#define FIO4PIN1_OFFSET 0x95

#define FIO4PIN2 (*(volatile unsigned char *)0x2009C096)
#define FIO4PIN2_OFFSET 0x96

#define FIO4PIN3 (*(volatile unsigned char *)0x2009C097)
#define FIO4PIN3_OFFSET 0x97

#define FIO4PINL (*(volatile unsigned short *)0x2009C094)
#define FIO4PINL_OFFSET 0x94

#define FIO4PINU (*(volatile unsigned short *)0x2009C096)
#define FIO4PINH FIO4PINU
#define FIO4PINU_OFFSET 0x96
#define FIO4PINH_OFFSET FIO4PINU_OFFSET

#define FIO0SET (*(volatile unsigned long *)0x2009C018)
#define FIO0SET_OFFSET 0x18

#define FIO0SET0 (*(volatile unsigned char *)0x2009C018)
#define FIO0SET0_OFFSET 0x18

#define FIO0SET1 (*(volatile unsigned char *)0x2009C019)
#define FIO0SET1_OFFSET 0x19

#define FIO0SET2 (*(volatile unsigned char *)0x2009C01A)
#define FIO0SET2_OFFSET 0x1A

#define FIO0SET3 (*(volatile unsigned char *)0x2009C01B)
#define FIO0SET3_OFFSET 0x1B

#define FIO0SETL (*(volatile unsigned short *)0x2009C018)
#define FIO0SETL_OFFSET 0x18

#define FIO0SETU (*(volatile unsigned short *)0x2009C01A)
#define FIO0SETH FIO0SETU
#define FIO0SETU_OFFSET 0x1A
#define FIO0SETH_OFFSET FIO0SETU_OFFSET

#define FIO1SET (*(volatile unsigned long *)0x2009C038)
#define FIO1SET_OFFSET 0x38

#define FIO1SET0 (*(volatile unsigned char *)0x2009C038)
#define FIO1SET0_OFFSET 0x38

#define FIO1SET1 (*(volatile unsigned char *)0x2009C039)
#define FIO1SET1_OFFSET 0x39

#define FIO1SET2 (*(volatile unsigned char *)0x2009C03A)
#define FIO1SET2_OFFSET 0x3A

#define FIO1SET3 (*(volatile unsigned char *)0x2009C03B)
#define FIO1SET3_OFFSET 0x3B

#define FIO1SETL (*(volatile unsigned short *)0x2009C038)
#define FIO1SETL_OFFSET 0x38

#define FIO1SETU (*(volatile unsigned short *)0x2009C03A)
#define FIO1SETH FIO1SETU
#define FIO1SETU_OFFSET 0x3A
#define FIO1SETH_OFFSET FIO1SETU_OFFSET

#define FIO2SET (*(volatile unsigned long *)0x2009C058)
#define FIO2SET_OFFSET 0x58

