FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1766.h
#define CTIME2 (*(volatile unsigned long *)0x4002401C)
#define CTIME2_OFFSET 0x1C
#define CTIME2_Day_of_Year_MASK 0xFFF
#define CTIME2_Day_of_Year_BIT 0

#define SEC (*(volatile unsigned long *)0x40024020)
#define SEC_OFFSET 0x20

#define MIN (*(volatile unsigned long *)0x40024024)
#define MIN_OFFSET 0x24

#define HOUR (*(volatile unsigned long *)0x40024028)
#define HOUR_OFFSET 0x28

#define DOM (*(volatile unsigned long *)0x4002402C)
#define DOM_OFFSET 0x2C

#define DOW (*(volatile unsigned long *)0x40024030)
#define DOW_OFFSET 0x30

#define DOY (*(volatile unsigned long *)0x40024034)
#define DOY_OFFSET 0x34

#define MONTH (*(volatile unsigned long *)0x40024038)
#define MONTH_OFFSET 0x38

#define YEAR (*(volatile unsigned long *)0x4002403C)
#define YEAR_OFFSET 0x3C

#define CALIBRATION (*(volatile unsigned long *)0x40024040)
#define CALIBRATION_OFFSET 0x40
#define CALIBRATION_CALVAL_MASK 0x1FFFF
#define CALIBRATION_CALVAL_BIT 0
#define CALIBRATION_CALDIR_MASK 0x20000
#define CALIBRATION_CALDIR 0x20000
#define CALIBRATION_CALDIR_BIT 17

#define GPREG0 (*(volatile unsigned long *)0x40024044)
#define GPREG0_OFFSET 0x44

#define GPREG1 (*(volatile unsigned long *)0x40024048)
#define GPREG1_OFFSET 0x48

#define GPREG2 (*(volatile unsigned long *)0x4002404C)
#define GPREG2_OFFSET 0x4C

#define GPREG3 (*(volatile unsigned long *)0x40024050)
#define GPREG3_OFFSET 0x50

#define GPREG4 (*(volatile unsigned long *)0x40024054)
#define GPREG4_OFFSET 0x54

#define RTC_AUXEN (*(volatile unsigned char *)0x40024058)
#define RTC_AUXEN_OFFSET 0x58
#define RTC_AUXEN_RTC_OSCFEN_MASK 0x10
#define RTC_AUXEN_RTC_OSCFEN 0x10
#define RTC_AUXEN_RTC_OSCFEN_BIT 4

#define RTC_AUX (*(volatile unsigned char *)0x4002405C)
#define RTC_AUX_OFFSET 0x5C
#define RTC_AUX_RTC_OSCF_MASK 0x10
#define RTC_AUX_RTC_OSCF 0x10
#define RTC_AUX_RTC_OSCF_BIT 4

#define ALSEC (*(volatile unsigned long *)0x40024060)
#define ALSEC_OFFSET 0x60

#define ALMIN (*(volatile unsigned long *)0x40024064)
#define ALMIN_OFFSET 0x64

#define ALHOUR (*(volatile unsigned long *)0x40024068)
#define ALHOUR_OFFSET 0x68

#define ALDOM (*(volatile unsigned long *)0x4002406C)
#define ALDOM_OFFSET 0x6C

#define ALDOW (*(volatile unsigned long *)0x40024070)
#define ALDOW_OFFSET 0x70

#define ALDOY (*(volatile unsigned long *)0x40024074)
#define ALDOY_OFFSET 0x74

#define ALMON (*(volatile unsigned long *)0x40024078)
#define ALMON_OFFSET 0x78

#define ALYEAR (*(volatile unsigned long *)0x4002407C)
#define ALYEAR_OFFSET 0x7C

#define GPIO_INT_BASE_ADDRESS 0x40028000

#define IOIntStatus (*(volatile unsigned long *)0x40028080)
#define IOIntStatus_OFFSET 0x80
#define IOIntStatus_P0Int_MASK 0x1
#define IOIntStatus_P0Int 0x1
#define IOIntStatus_P0Int_BIT 0
#define IOIntStatus_P2Int_MASK 0x4
#define IOIntStatus_P2Int 0x4
#define IOIntStatus_P2Int_BIT 2

#define IO0IntStatR (*(volatile unsigned long *)0x40028084)
#define IO0IntStatR_OFFSET 0x84

#define IO0IntStatF (*(volatile unsigned long *)0x40028088)
#define IO0IntStatF_OFFSET 0x88

#define IO0IntClr (*(volatile unsigned long *)0x4002808C)
#define IO0IntClr_OFFSET 0x8C

#define IO0IntEnR (*(volatile unsigned long *)0x40028090)
#define IO0IntEnR_OFFSET 0x90

#define IO0IntEnF (*(volatile unsigned long *)0x40028094)
#define IO0IntEnF_OFFSET 0x94

#define IO2IntStatR (*(volatile unsigned long *)0x400280A4)
#define IO2IntStatR_OFFSET 0xA4

#define IO2IntStatF (*(volatile unsigned long *)0x400280A8)
#define IO2IntStatF_OFFSET 0xA8

#define IO2IntClr (*(volatile unsigned long *)0x400280AC)
#define IO2IntClr_OFFSET 0xAC

#define IO2IntEnR (*(volatile unsigned long *)0x400280B0)
#define IO2IntEnR_OFFSET 0xB0

#define IO2IntEnF (*(volatile unsigned long *)0x400280B4)
#define IO2IntEnF_OFFSET 0xB4

#define PCB_BASE_ADDRESS 0x4002C000

#define PINSEL0 (*(volatile unsigned long *)0x4002C000)
#define PINSEL0_OFFSET 0x0
#define PINSEL0_P0_0_MASK 0x3
#define PINSEL0_P0_0_BIT 0
#define PINSEL0_P0_1_MASK 0xC
#define PINSEL0_P0_1_BIT 2
#define PINSEL0_P0_2_MASK 0x30
#define PINSEL0_P0_2_BIT 4
#define PINSEL0_P0_3_MASK 0xC0
#define PINSEL0_P0_3_BIT 6
#define PINSEL0_P0_4_MASK 0x300
#define PINSEL0_P0_4_BIT 8
#define PINSEL0_P0_5_MASK 0xC00
#define PINSEL0_P0_5_BIT 10
#define PINSEL0_P0_6_MASK 0x3000
#define PINSEL0_P0_6_BIT 12
#define PINSEL0_P0_7_MASK 0xC000
#define PINSEL0_P0_7_BIT 14
#define PINSEL0_P0_8_MASK 0x30000
#define PINSEL0_P0_8_BIT 16
#define PINSEL0_P0_9_MASK 0xC0000
#define PINSEL0_P0_9_BIT 18
#define PINSEL0_P0_10_MASK 0x300000
#define PINSEL0_P0_10_BIT 20
#define PINSEL0_P0_11_MASK 0xC00000
#define PINSEL0_P0_11_BIT 22
#define PINSEL0_P0_15_MASK 0xC0000000
#define PINSEL0_P0_15_BIT 30

#define PINSEL1 (*(volatile unsigned long *)0x4002C004)
#define PINSEL1_OFFSET 0x4
#define PINSEL1_P0_16_MASK 0x3
#define PINSEL1_P0_16_BIT 0
#define PINSEL1_P0_17_MASK 0xC
#define PINSEL1_P0_17_BIT 2
#define PINSEL1_P0_18_MASK 0x30
#define PINSEL1_P0_18_BIT 4
#define PINSEL1_P0_19_MASK 0xC0
#define PINSEL1_P0_19_BIT 6
#define PINSEL1_P0_20_MASK 0x300
#define PINSEL1_P0_20_BIT 8
#define PINSEL1_P0_21_MASK 0xC00
#define PINSEL1_P0_21_BIT 10
#define PINSEL1_P0_22_MASK 0x3000
#define PINSEL1_P0_22_BIT 12
#define PINSEL1_P0_23_MASK 0xC000
#define PINSEL1_P0_23_BIT 14
#define PINSEL1_P0_24_MASK 0x30000
#define PINSEL1_P0_24_BIT 16
#define PINSEL1_P0_25_MASK 0xC0000
#define PINSEL1_P0_25_BIT 18
#define PINSEL1_P0_26_MASK 0x300000
#define PINSEL1_P0_26_BIT 20
#define PINSEL1_P0_27_MASK 0xC00000
#define PINSEL1_P0_27_BIT 22
#define PINSEL1_P0_28_MASK 0x3000000
#define PINSEL1_P0_28_BIT 24
#define PINSEL1_P0_29_MASK 0xC000000
#define PINSEL1_P0_29_BIT 26
#define PINSEL1_P0_30_MASK 0x30000000
#define PINSEL1_P0_30_BIT 28

#define PINSEL2 (*(volatile unsigned long *)0x4002C008)
#define PINSEL2_OFFSET 0x8
#define PINSEL2_P1_0_MASK 0x3
#define PINSEL2_P1_0_BIT 0
#define PINSEL2_P1_1_MASK 0xC
#define PINSEL2_P1_1_BIT 2
#define PINSEL2_P1_4_MASK 0x300
#define PINSEL2_P1_4_BIT 8
#define PINSEL2_P1_8_MASK 0x30000
#define PINSEL2_P1_8_BIT 16
#define PINSEL2_P1_9_MASK 0xC0000
#define PINSEL2_P1_9_BIT 18
#define PINSEL2_P1_10_MASK 0x300000
#define PINSEL2_P1_10_BIT 20
#define PINSEL2_P1_14_MASK 0x30000000
#define PINSEL2_P1_14_BIT 28
#define PINSEL2_P1_15_MASK 0xC0000000
#define PINSEL2_P1_15_BIT 30

#define PINSEL3 (*(volatile unsigned long *)0x4002C00C)
#define PINSEL3_OFFSET 0xC
#define PINSEL3_P1_16_MASK 0x3
#define PINSEL3_P1_16_BIT 0
#define PINSEL3_P1_17_MASK 0xC
#define PINSEL3_P1_17_BIT 2
#define PINSEL3_P1_18_MASK 0x30
#define PINSEL3_P1_18_BIT 4
#define PINSEL3_P1_19_MASK 0xC0
#define PINSEL3_P1_19_BIT 6
#define PINSEL3_P1_20_MASK 0x300
#define PINSEL3_P1_20_BIT 8
#define PINSEL3_P1_21_MASK 0xC00
#define PINSEL3_P1_21_BIT 10
#define PINSEL3_P1_22_MASK 0x3000
#define PINSEL3_P1_22_BIT 12
#define PINSEL3_P1_23_MASK 0xC000
#define PINSEL3_P1_23_BIT 14
#define PINSEL3_P1_24_MASK 0x30000
#define PINSEL3_P1_24_BIT 16
#define PINSEL3_P1_25_MASK 0xC0000
#define PINSEL3_P1_25_BIT 18
#define PINSEL3_P1_26_MASK 0x300000
#define PINSEL3_P1_26_BIT 20
#define PINSEL3_P1_27_MASK 0xC00000
#define PINSEL3_P1_27_BIT 22
#define PINSEL3_P1_28_MASK 0x3000000
#define PINSEL3_P1_28_BIT 24
#define PINSEL3_P1_29_MASK 0xC000000
#define PINSEL3_P1_29_BIT 26
#define PINSEL3_P1_30_MASK 0x30000000
#define PINSEL3_P1_30_BIT 28
#define PINSEL3_P1_31_MASK 0xC0000000
#define PINSEL3_P1_31_BIT 30

#define PINSEL4 (*(volatile unsigned long *)0x4002C010)
#define PINSEL4_OFFSET 0x10
#define PINSEL4_P2_0_MASK 0x3
#define PINSEL4_P2_0_BIT 0
#define PINSEL4_P2_1_MASK 0xC
#define PINSEL4_P2_1_BIT 2
#define PINSEL4_P2_2_MASK 0x30
#define PINSEL4_P2_2_BIT 4
#define PINSEL4_P2_3_MASK 0xC0
#define PINSEL4_P2_3_BIT 6
#define PINSEL4_P2_4_MASK 0x300
#define PINSEL4_P2_4_BIT 8
#define PINSEL4_P2_5_MASK 0xC00
#define PINSEL4_P2_5_BIT 10
#define PINSEL4_P2_6_MASK 0x3000
#define PINSEL4_P2_6_BIT 12
#define PINSEL4_P2_7_MASK 0xC000
#define PINSEL4_P2_7_BIT 14
#define PINSEL4_P2_8_MASK 0x30000
#define PINSEL4_P2_8_BIT 16
#define PINSEL4_P2_9_MASK 0xC0000
#define PINSEL4_P2_9_BIT 18
#define PINSEL4_P2_10_MASK 0x300000
#define PINSEL4_P2_10_BIT 20
#define PINSEL4_P2_11_MASK 0xC00000
#define PINSEL4_P2_11_BIT 22
#define PINSEL4_P2_12_MASK 0x3000000
#define PINSEL4_P2_12_BIT 24
#define PINSEL4_P2_13_MASK 0xC000000
#define PINSEL4_P2_13_BIT 26

#define PINSEL5 (*(volatile unsigned long *)0x4002C014)
#define PINSEL5_OFFSET 0x14

