FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1766.h
#define QEISET (*(volatile unsigned long *)0x400BCFEC)
#define QEISET_OFFSET 0xFEC
#define QEISET_INX_Int_MASK 0x1
#define QEISET_INX_Int 0x1
#define QEISET_INX_Int_BIT 0
#define QEISET_TIM_Int_MASK 0x2
#define QEISET_TIM_Int 0x2
#define QEISET_TIM_Int_BIT 1
#define QEISET_VELC_Int_MASK 0x4
#define QEISET_VELC_Int 0x4
#define QEISET_VELC_Int_BIT 2
#define QEISET_DIR_Int_MASK 0x8
#define QEISET_DIR_Int 0x8
#define QEISET_DIR_Int_BIT 3
#define QEISET_ERR_Int_MASK 0x10
#define QEISET_ERR_Int 0x10
#define QEISET_ERR_Int_BIT 4
#define QEISET_ENCLK_Int_MASK 0x20
#define QEISET_ENCLK_Int 0x20
#define QEISET_ENCLK_Int_BIT 5
#define QEISET_POS0_Int_MASK 0x40
#define QEISET_POS0_Int 0x40
#define QEISET_POS0_Int_BIT 6
#define QEISET_POS1_Int_MASK 0x80
#define QEISET_POS1_Int 0x80
#define QEISET_POS1_Int_BIT 7
#define QEISET_POS2_Int_MASK 0x100
#define QEISET_POS2_Int 0x100
#define QEISET_POS2_Int_BIT 8
#define QEISET_REV_Int_MASK 0x200
#define QEISET_REV_Int 0x200
#define QEISET_REV_Int_BIT 9
#define QEISET_POS0REV_Int_MASK 0x400
#define QEISET_POS0REV_Int 0x400
#define QEISET_POS0REV_Int_BIT 10
#define QEISET_POS1REV_Int_MASK 0x800
#define QEISET_POS1REV_Int 0x800
#define QEISET_POS1REV_Int_BIT 11
#define QEISET_POS2REV_Int_MASK 0x1000
#define QEISET_POS2REV_Int 0x1000
#define QEISET_POS2REV_Int_BIT 12

#define SC_BASE_ADDRESS 0x400FC000

#define FLASHCFG (*(volatile unsigned long *)0x400FC000)
#define FLASHCFG_OFFSET 0x0
#define FLASHCFG_FLASHTIM_MASK 0xF000
#define FLASHCFG_FLASHTIM_BIT 12

#define CLKSRCSEL (*(volatile unsigned long *)0x400FC10C)
#define CLKSRCSEL_OFFSET 0x10C
#define CLKSRCSEL_CLKSRC_MASK 0x3
#define CLKSRCSEL_CLKSRC_BIT 0

#define PLL0CON (*(volatile unsigned long *)0x400FC080)
#define PLL0CON_OFFSET 0x80
#define PLL0CON_PLLE0_MASK 0x1
#define PLL0CON_PLLE0 0x1
#define PLL0CON_PLLE0_BIT 0
#define PLL0CON_PLLC0_MASK 0x2
#define PLL0CON_PLLC0 0x2
#define PLL0CON_PLLC0_BIT 1

#define PLL0CFG (*(volatile unsigned long *)0x400FC084)
#define PLL0CFG_OFFSET 0x84
#define PLL0CFG_MSEL0_MASK 0x7FFF
#define PLL0CFG_MSEL0_BIT 0
#define PLL0CFG_NSEL0_MASK 0xFF0000
#define PLL0CFG_NSEL0_BIT 16

#define PLL0STAT (*(volatile unsigned long *)0x400FC088)
#define PLL0STAT_OFFSET 0x88
#define PLL0STAT_MSEL0_MASK 0x7FFF
#define PLL0STAT_MSEL0_BIT 0
#define PLL0STAT_NSEL0_MASK 0xFF0000
#define PLL0STAT_NSEL0_BIT 16
#define PLL0STAT_PLLE0_STAT_MASK 0x1000000
#define PLL0STAT_PLLE0_STAT 0x1000000
#define PLL0STAT_PLLE0_STAT_BIT 24
#define PLL0STAT_PLLC0_STAT_MASK 0x2000000
#define PLL0STAT_PLLC0_STAT 0x2000000
#define PLL0STAT_PLLC0_STAT_BIT 25
#define PLL0STAT_PLOCK0_MASK 0x4000000
#define PLL0STAT_PLOCK0 0x4000000
#define PLL0STAT_PLOCK0_BIT 26

#define PLL0FEED (*(volatile unsigned long *)0x400FC08C)
#define PLL0FEED_OFFSET 0x8C

#define PLL1CON (*(volatile unsigned long *)0x400FC0A0)
#define PLL1CON_OFFSET 0xA0
#define PLL1CON_PLLE1_MASK 0x1
#define PLL1CON_PLLE1 0x1
#define PLL1CON_PLLE1_BIT 0
#define PLL1CON_PLLC1_MASK 0x2
#define PLL1CON_PLLC1 0x2
#define PLL1CON_PLLC1_BIT 1

#define PLL1CFG (*(volatile unsigned long *)0x400FC0A4)
#define PLL1CFG_OFFSET 0xA4
#define PLL1CFG_MSEL1_MASK 0x1F
#define PLL1CFG_MSEL1_BIT 0
#define PLL1CFG_PSEL1_MASK 0x60
#define PLL1CFG_PSEL1_BIT 5

#define PLL1STAT (*(volatile unsigned long *)0x400FC0A8)
#define PLL1STAT_OFFSET 0xA8
#define PLL1STAT_MSEL1_MASK 0x1F
#define PLL1STAT_MSEL1_BIT 0
#define PLL1STAT_PSEL1_MASK 0x60
#define PLL1STAT_PSEL1_BIT 5
#define PLL1STAT_PLLE1_STAT_MASK 0x100
#define PLL1STAT_PLLE1_STAT 0x100
#define PLL1STAT_PLLE1_STAT_BIT 8
#define PLL1STAT_PLLC1_STAT_MASK 0x200
#define PLL1STAT_PLLC1_STAT 0x200
#define PLL1STAT_PLLC1_STAT_BIT 9
#define PLL1STAT_PLOCK1_MASK 0x400
#define PLL1STAT_PLOCK1 0x400
#define PLL1STAT_PLOCK1_BIT 10

#define PLL1FEED (*(volatile unsigned long *)0x400FC0AC)
#define PLL1FEED_OFFSET 0xAC

#define CCLKCFG (*(volatile unsigned long *)0x400FC104)
#define CCLKCFG_OFFSET 0x104
#define CCLKCFG_CCLKSEL_MASK 0xFF
#define CCLKCFG_CCLKSEL_BIT 0

#define USBCLKCFG (*(volatile unsigned long *)0x400FC108)
#define USBCLKCFG_OFFSET 0x108
#define USBCLKCFG_USBSEL_MASK 0xF
#define USBCLKCFG_USBSEL_BIT 0

#define IRCTRIM (*(volatile unsigned long *)0x400FC1A4)
#define IRCTRIM_OFFSET 0x1A4
#define IRCTRIM_IRCtrim_MASK 0xFF
#define IRCTRIM_IRCtrim_BIT 0

#define PCLKSEL0 (*(volatile unsigned long *)0x400FC1A8)
#define PCLKSEL0_OFFSET 0x1A8
#define PCLKSEL0_PCLK_WDT_MASK 0x3
#define PCLKSEL0_PCLK_WDT_BIT 0
#define PCLKSEL0_PCLK_TIMER0_MASK 0xC
#define PCLKSEL0_PCLK_TIMER0_BIT 2
#define PCLKSEL0_PCLK_TIMER1_MASK 0x30
#define PCLKSEL0_PCLK_TIMER1_BIT 4
#define PCLKSEL0_PCLK_UART0_MASK 0xC0
#define PCLKSEL0_PCLK_UART0_BIT 6
#define PCLKSEL0_PCLK_UART1_MASK 0x300
#define PCLKSEL0_PCLK_UART1_BIT 8
#define PCLKSEL0_PCLK_PWM1_MASK 0x3000
#define PCLKSEL0_PCLK_PWM1_BIT 12
#define PCLKSEL0_PCLK_I2C0_MASK 0xC000
#define PCLKSEL0_PCLK_I2C0_BIT 14
#define PCLKSEL0_PCLK_SPI_MASK 0x30000
#define PCLKSEL0_PCLK_SPI_BIT 16
#define PCLKSEL0_PCLK_SSP1_MASK 0x300000
#define PCLKSEL0_PCLK_SSP1_BIT 20
#define PCLKSEL0_PCLK_DAC_MASK 0xC00000
#define PCLKSEL0_PCLK_DAC_BIT 22
#define PCLKSEL0_PCLK_ADC_MASK 0x3000000
#define PCLKSEL0_PCLK_ADC_BIT 24
#define PCLKSEL0_PCLK_CAN1_MASK 0xC000000
#define PCLKSEL0_PCLK_CAN1_BIT 26
#define PCLKSEL0_PCLK_CAN2_MASK 0x30000000
#define PCLKSEL0_PCLK_CAN2_BIT 28
#define PCLKSEL0_PCLK_ACF_MASK 0xC0000000
#define PCLKSEL0_PCLK_ACF_BIT 30

#define PCLKSEL1 (*(volatile unsigned long *)0x400FC1AC)
#define PCLKSEL1_OFFSET 0x1AC
#define PCLKSEL1_PCLK_QEI_MASK 0x3
#define PCLKSEL1_PCLK_QEI_BIT 0
#define PCLKSEL1_PCLK_GPIOINT_MASK 0xC
#define PCLKSEL1_PCLK_GPIOINT_BIT 2
#define PCLKSEL1_PCLK_PCB_MASK 0x30
#define PCLKSEL1_PCLK_PCB_BIT 4
#define PCLKSEL1_PCLK_I2C1_MASK 0xC0
#define PCLKSEL1_PCLK_I2C1_BIT 6
#define PCLKSEL1_PCLK_SSP0_MASK 0xC00
#define PCLKSEL1_PCLK_SSP0_BIT 10
#define PCLKSEL1_PCLK_TIMER2_MASK 0x3000
#define PCLKSEL1_PCLK_TIMER2_BIT 12
#define PCLKSEL1_PCLK_TIMER3_MASK 0xC000
#define PCLKSEL1_PCLK_TIMER3_BIT 14
#define PCLKSEL1_PCLK_UART2_MASK 0x30000
#define PCLKSEL1_PCLK_UART2_BIT 16
#define PCLKSEL1_PCLK_UART3_MASK 0xC0000
#define PCLKSEL1_PCLK_UART3_BIT 18
#define PCLKSEL1_PCLK_I2C2_MASK 0x300000
#define PCLKSEL1_PCLK_I2C2_BIT 20
#define PCLKSEL1_PCLK_I2S_MASK 0xC00000
#define PCLKSEL1_PCLK_I2S_BIT 22
#define PCLKSEL1_PCLK_RIT_MASK 0xC000000
#define PCLKSEL1_PCLK_RIT_BIT 26
#define PCLKSEL1_PCLK_SYSCON_MASK 0x30000000
#define PCLKSEL1_PCLK_SYSCON_BIT 28
#define PCLKSEL1_PCLK_MC_MASK 0xC0000000
#define PCLKSEL1_PCLK_MC_BIT 30

#define PCON (*(volatile unsigned long *)0x400FC0C0)
#define PCON_OFFSET 0xC0
#define PCON_PM0_MASK 0x1
#define PCON_PM0 0x1
#define PCON_PM0_BIT 0
#define PCON_PM1_MASK 0x2
#define PCON_PM1 0x2
#define PCON_PM1_BIT 1
#define PCON_BODRPM_MASK 0x4
#define PCON_BODRPM 0x4
#define PCON_BODRPM_BIT 2
#define PCON_BOGD_MASK 0x8
#define PCON_BOGD 0x8
#define PCON_BOGD_BIT 3
#define PCON_BORD_MASK 0x10
#define PCON_BORD 0x10
#define PCON_BORD_BIT 4
#define PCON_SMFLAG_MASK 0x100
#define PCON_SMFLAG 0x100
#define PCON_SMFLAG_BIT 8
#define PCON_DSFLAG_MASK 0x200
#define PCON_DSFLAG 0x200
#define PCON_DSFLAG_BIT 9
#define PCON_PDFLAG_MASK 0x400
#define PCON_PDFLAG 0x400
#define PCON_PDFLAG_BIT 10
#define PCON_DPDFLAG_MASK 0x800
#define PCON_DPDFLAG 0x800
#define PCON_DPDFLAG_BIT 11

#define PCONP (*(volatile unsigned long *)0x400FC0C4)
#define PCONP_OFFSET 0xC4
#define PCONP_PCTIM0_MASK 0x2
#define PCONP_PCTIM0 0x2
#define PCONP_PCTIM0_BIT 1
#define PCONP_PCTIM1_MASK 0x4
#define PCONP_PCTIM1 0x4
#define PCONP_PCTIM1_BIT 2
#define PCONP_PCUART0_MASK 0x8
#define PCONP_PCUART0 0x8
#define PCONP_PCUART0_BIT 3
#define PCONP_PCUART1_MASK 0x10
#define PCONP_PCUART1 0x10
#define PCONP_PCUART1_BIT 4
#define PCONP_PWM1_MASK 0x40
#define PCONP_PWM1 0x40
#define PCONP_PWM1_BIT 6
#define PCONP_PCI2C0_MASK 0x80
#define PCONP_PCI2C0 0x80
#define PCONP_PCI2C0_BIT 7
#define PCONP_PCSPI_MASK 0x100
#define PCONP_PCSPI 0x100
#define PCONP_PCSPI_BIT 8
#define PCONP_PCRTC_MASK 0x200
#define PCONP_PCRTC 0x200
#define PCONP_PCRTC_BIT 9
#define PCONP_PCSSP_MASK 0x400
#define PCONP_PCSSP 0x400
#define PCONP_PCSSP_BIT 10
#define PCONP_PCAD_MASK 0x1000
#define PCONP_PCAD 0x1000
#define PCONP_PCAD_BIT 12
#define PCONP_PCCAN1_MASK 0x2000
#define PCONP_PCCAN1 0x2000
#define PCONP_PCCAN1_BIT 13
#define PCONP_PCCAN2_MASK 0x4000
#define PCONP_PCCAN2 0x4000
#define PCONP_PCCAN2_BIT 14
#define PCONP_PCGPIO_MASK 0x8000
#define PCONP_PCGPIO 0x8000
#define PCONP_PCGPIO_BIT 15
#define PCONP_PCRIT_MASK 0x10000
#define PCONP_PCRIT 0x10000
#define PCONP_PCRIT_BIT 16
#define PCONP_PCMC_MASK 0x20000
#define PCONP_PCMC 0x20000
#define PCONP_PCMC_BIT 17
#define PCONP_PCQEI_MASK 0x40000
#define PCONP_PCQEI 0x40000
#define PCONP_PCQEI_BIT 18
#define PCONP_PCI2C1_MASK 0x80000
#define PCONP_PCI2C1 0x80000
#define PCONP_PCI2C1_BIT 19
#define PCONP_PCSSP0_MASK 0x200000
#define PCONP_PCSSP0 0x200000
#define PCONP_PCSSP0_BIT 21
#define PCONP_PCTIM2_MASK 0x400000
#define PCONP_PCTIM2 0x400000
#define PCONP_PCTIM2_BIT 22
#define PCONP_PCTIM3_MASK 0x800000
#define PCONP_PCTIM3 0x800000
#define PCONP_PCTIM3_BIT 23
#define PCONP_PCUART2_MASK 0x1000000
#define PCONP_PCUART2 0x1000000
#define PCONP_PCUART2_BIT 24
#define PCONP_PCUART3_MASK 0x2000000
#define PCONP_PCUART3 0x2000000
#define PCONP_PCUART3_BIT 25
#define PCONP_PCI2C2_MASK 0x4000000
#define PCONP_PCI2C2 0x4000000
#define PCONP_PCI2C2_BIT 26
#define PCONP_PCI2S_MASK 0x8000000
#define PCONP_PCI2S 0x8000000
#define PCONP_PCI2S_BIT 27
#define PCONP_PCGPDMA_MASK 0x20000000
#define PCONP_PCGPDMA 0x20000000
#define PCONP_PCGPDMA_BIT 29
#define PCONP_PCENET_MASK 0x40000000
#define PCONP_PCENET 0x40000000
#define PCONP_PCENET_BIT 30
#define PCONP_PCUSB_MASK 0x80000000
#define PCONP_PCUSB 0x80000000
#define PCONP_PCUSB_BIT 31

#define CLKOUTCFG (*(volatile unsigned long *)0x400FC1C8)
#define CLKOUTCFG_OFFSET 0x1C8
#define CLKOUTCFG_CLKOUTSEL_MASK 0xF
#define CLKOUTCFG_CLKOUTSEL_BIT 0
#define CLKOUTCFG_CLKOUTDIV_MASK 0xF0
#define CLKOUTCFG_CLKOUTDIV_BIT 4
#define CLKOUTCFG_CLKOUT_EN_MASK 0x100
#define CLKOUTCFG_CLKOUT_EN 0x100
#define CLKOUTCFG_CLKOUT_EN_BIT 8
#define CLKOUTCFG_CLKOUT_ACT_MASK 0x200
#define CLKOUTCFG_CLKOUT_ACT 0x200
#define CLKOUTCFG_CLKOUT_ACT_BIT 9

