FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1766.h
#define CANSLEEPCLR (*(volatile unsigned long *)0x400FC110)
#define CANSLEEPCLR_OFFSET 0x110
#define CANSLEEPCLR_CAN1SLEEP_MASK 0x2
#define CANSLEEPCLR_CAN1SLEEP 0x2
#define CANSLEEPCLR_CAN1SLEEP_BIT 1
#define CANSLEEPCLR_CAN2SLEEP_MASK 0x4
#define CANSLEEPCLR_CAN2SLEEP 0x4
#define CANSLEEPCLR_CAN2SLEEP_BIT 2

#define CANWAKEFLAGS (*(volatile unsigned long *)0x400FC114)
#define CANWAKEFLAGS_OFFSET 0x114
#define CANWAKEFLAGS_CAN1WAKE_MASK 0x2
#define CANWAKEFLAGS_CAN1WAKE 0x2
#define CANWAKEFLAGS_CAN1WAKE_BIT 1
#define CANWAKEFLAGS_CAN2WAKE_MASK 0x4
#define CANWAKEFLAGS_CAN2WAKE 0x4
#define CANWAKEFLAGS_CAN2WAKE_BIT 2

#define EXTINT (*(volatile unsigned char *)0x400FC140)
#define EXTINT_OFFSET 0x140
#define EXTINT_EINT0_MASK 0x1
#define EXTINT_EINT0 0x1
#define EXTINT_EINT0_BIT 0
#define EXTINT_EINT1_MASK 0x2
#define EXTINT_EINT1 0x2
#define EXTINT_EINT1_BIT 1
#define EXTINT_EINT2_MASK 0x4
#define EXTINT_EINT2 0x4
#define EXTINT_EINT2_BIT 2
#define EXTINT_EINT3_MASK 0x8
#define EXTINT_EINT3 0x8
#define EXTINT_EINT3_BIT 3

#define EXTMODE (*(volatile unsigned char *)0x400FC148)
#define EXTMODE_OFFSET 0x148
#define EXTMODE_EXTMODE0_MASK 0x1
#define EXTMODE_EXTMODE0 0x1
#define EXTMODE_EXTMODE0_BIT 0
#define EXTMODE_EXTMODE1_MASK 0x2
#define EXTMODE_EXTMODE1 0x2
#define EXTMODE_EXTMODE1_BIT 1
#define EXTMODE_EXTMODE2_MASK 0x4
#define EXTMODE_EXTMODE2 0x4
#define EXTMODE_EXTMODE2_BIT 2
#define EXTMODE_EXTMODE3_MASK 0x8
#define EXTMODE_EXTMODE3 0x8
#define EXTMODE_EXTMODE3_BIT 3

#define EXTPOLAR (*(volatile unsigned char *)0x400FC14C)
#define EXTPOLAR_OFFSET 0x14C
#define EXTPOLAR_EXTPOLAR0_MASK 0x1
#define EXTPOLAR_EXTPOLAR0 0x1
#define EXTPOLAR_EXTPOLAR0_BIT 0
#define EXTPOLAR_EXTPOLAR1_MASK 0x2
#define EXTPOLAR_EXTPOLAR1 0x2
#define EXTPOLAR_EXTPOLAR1_BIT 1
#define EXTPOLAR_EXTPOLAR2_MASK 0x4
#define EXTPOLAR_EXTPOLAR2 0x4
#define EXTPOLAR_EXTPOLAR2_BIT 2
#define EXTPOLAR_EXTPOLAR3_MASK 0x8
#define EXTPOLAR_EXTPOLAR3 0x8
#define EXTPOLAR_EXTPOLAR3_BIT 3

#define RSID (*(volatile unsigned char *)0x400FC180)
#define RSID_OFFSET 0x180
#define RSID_POR_MASK 0x1
#define RSID_POR 0x1
#define RSID_POR_BIT 0
#define RSID_EXTR_MASK 0x2
#define RSID_EXTR 0x2
#define RSID_EXTR_BIT 1
#define RSID_WDTR_MASK 0x4
#define RSID_WDTR 0x4
#define RSID_WDTR_BIT 2
#define RSID_BODR_MASK 0x8
#define RSID_BODR 0x8
#define RSID_BODR_BIT 3

#define SCS (*(volatile unsigned char *)0x400FC1A0)
#define SCS_OFFSET 0x1A0
#define SCS_OSCRANGE_MASK 0x10
#define SCS_OSCRANGE 0x10
#define SCS_OSCRANGE_BIT 4
#define SCS_OSCEN_MASK 0x20
#define SCS_OSCEN 0x20
#define SCS_OSCEN_BIT 5
#define SCS_OSCSTAT_MASK 0x40
#define SCS_OSCSTAT 0x40
#define SCS_OSCSTAT_BIT 6

#define USBIntSt (*(volatile unsigned long *)0x400FC1C0)
#define USBIntSt_OFFSET 0x1C0
#define USBIntSt_USB_INT_REQ_LP_MASK 0x1
#define USBIntSt_USB_INT_REQ_LP 0x1
#define USBIntSt_USB_INT_REQ_LP_BIT 0
#define USBIntSt_USB_INT_REQ_HP_MASK 0x2
#define USBIntSt_USB_INT_REQ_HP 0x2
#define USBIntSt_USB_INT_REQ_HP_BIT 1
#define USBIntSt_USB_INT_REQ_DMA_MASK 0x4
#define USBIntSt_USB_INT_REQ_DMA 0x4
#define USBIntSt_USB_INT_REQ_DMA_BIT 2
#define USBIntSt_USB_HOST_INT_MASK 0x8
#define USBIntSt_USB_HOST_INT 0x8
#define USBIntSt_USB_HOST_INT_BIT 3
#define USBIntSt_USB_ATX_INT_MASK 0x10
#define USBIntSt_USB_ATX_INT 0x10
#define USBIntSt_USB_ATX_INT_BIT 4
#define USBIntSt_USB_OTG_INT_MASK 0x20
#define USBIntSt_USB_OTG_INT 0x20
#define USBIntSt_USB_OTG_INT_BIT 5
#define USBIntSt_USB_I2C_INT_MASK 0x40
#define USBIntSt_USB_I2C_INT 0x40
#define USBIntSt_USB_I2C_INT_BIT 6
#define USBIntSt_USB_NEED_CLK_MASK 0x100
#define USBIntSt_USB_NEED_CLK 0x100
#define USBIntSt_USB_NEED_CLK_BIT 8
#define USBIntSt_EN_USB_INTS_MASK 0x80000000
#define USBIntSt_EN_USB_INTS 0x80000000
#define USBIntSt_EN_USB_INTS_BIT 31

#define MAC_BASE_ADDRESS 0x50000000

#define MAC1 (*(volatile unsigned *)0x50000000)
#define MAC1_OFFSET 0x0
#define MAC1_RECEIVE_ENABLE_MASK 0x1
#define MAC1_RECEIVE_ENABLE 0x1
#define MAC1_RECEIVE_ENABLE_BIT 0
#define MAC1_PASS_ALL_RECEIVE_FRAMES_MASK 0x2
#define MAC1_PASS_ALL_RECEIVE_FRAMES 0x2
#define MAC1_PASS_ALL_RECEIVE_FRAMES_BIT 1
#define MAC1_RX_FLOW_CONTROL_MASK 0x4
#define MAC1_RX_FLOW_CONTROL 0x4
#define MAC1_RX_FLOW_CONTROL_BIT 2
#define MAC1_TX_FLOW_CONTROL_MASK 0x8
#define MAC1_TX_FLOW_CONTROL 0x8
#define MAC1_TX_FLOW_CONTROL_BIT 3
#define MAC1_LOOPBACK_MASK 0x10
#define MAC1_LOOPBACK 0x10
#define MAC1_LOOPBACK_BIT 4
#define MAC1_RESET_TX_MASK 0x100
#define MAC1_RESET_TX 0x100
#define MAC1_RESET_TX_BIT 8
#define MAC1_RESET_MCS_TX_MASK 0x200
#define MAC1_RESET_MCS_TX 0x200
#define MAC1_RESET_MCS_TX_BIT 9
#define MAC1_RESET_RX_MASK 0x400
#define MAC1_RESET_RX 0x400
#define MAC1_RESET_RX_BIT 10
#define MAC1_RESET_MCS_RX_MASK 0x800
#define MAC1_RESET_MCS_RX 0x800
#define MAC1_RESET_MCS_RX_BIT 11
#define MAC1_SIMULATION_RESET_MASK 0x4000
#define MAC1_SIMULATION_RESET 0x4000
#define MAC1_SIMULATION_RESET_BIT 14
#define MAC1_SOFT_RESET_MASK 0x8000
#define MAC1_SOFT_RESET 0x8000
#define MAC1_SOFT_RESET_BIT 15

#define MAC2 (*(volatile unsigned *)0x50000004)
#define MAC2_OFFSET 0x4
#define MAC2_FULL_DUPLEX_MASK 0x1
#define MAC2_FULL_DUPLEX 0x1
#define MAC2_FULL_DUPLEX_BIT 0
#define MAC2_FRAME_LENGTH_CHECKING_MASK 0x2
#define MAC2_FRAME_LENGTH_CHECKING 0x2
#define MAC2_FRAME_LENGTH_CHECKING_BIT 1
#define MAC2_HUGE_FRAME_ENABLE_MASK 0x4
#define MAC2_HUGE_FRAME_ENABLE 0x4
#define MAC2_HUGE_FRAME_ENABLE_BIT 2
#define MAC2_DELAYED_CRC_MASK 0x8
#define MAC2_DELAYED_CRC 0x8
#define MAC2_DELAYED_CRC_BIT 3
#define MAC2_CRC_ENABLE_MASK 0x10
#define MAC2_CRC_ENABLE 0x10
#define MAC2_CRC_ENABLE_BIT 4
#define MAC2_PAD_CRC_ENABLE_MASK 0x20
#define MAC2_PAD_CRC_ENABLE 0x20
#define MAC2_PAD_CRC_ENABLE_BIT 5
#define MAC2_VLAN_PAD_ENABLE_MASK 0x40
#define MAC2_VLAN_PAD_ENABLE 0x40
#define MAC2_VLAN_PAD_ENABLE_BIT 6
#define MAC2_AUTO_DETECT_PAD_ENABLE_MASK 0x80
#define MAC2_AUTO_DETECT_PAD_ENABLE 0x80
#define MAC2_AUTO_DETECT_PAD_ENABLE_BIT 7
#define MAC2_PURE_PREAMBLE_ENFORCEMENT_MASK 0x100
#define MAC2_PURE_PREAMBLE_ENFORCEMENT 0x100
#define MAC2_PURE_PREAMBLE_ENFORCEMENT_BIT 8
#define MAC2_LONG_PREAMBLE_ENFORCEMENT_MASK 0x200
#define MAC2_LONG_PREAMBLE_ENFORCEMENT 0x200
#define MAC2_LONG_PREAMBLE_ENFORCEMENT_BIT 9
#define MAC2_NO_BACKOFF_MASK 0x1000
#define MAC2_NO_BACKOFF 0x1000
#define MAC2_NO_BACKOFF_BIT 12
#define MAC2_BACK_PRESSURE_NO_BACKOFF_MASK 0x2000
#define MAC2_BACK_PRESSURE_NO_BACKOFF 0x2000
#define MAC2_BACK_PRESSURE_NO_BACKOFF_BIT 13
#define MAC2_EXCESS_DEFER_MASK 0x4000
#define MAC2_EXCESS_DEFER 0x4000
#define MAC2_EXCESS_DEFER_BIT 14

#define IPGT (*(volatile unsigned *)0x50000008)
#define IPGT_OFFSET 0x8
#define IPGT_BACK_TO_BACK_INTER_PACKET_GAP_MASK 0x7F
#define IPGT_BACK_TO_BACK_INTER_PACKET_GAP_BIT 0

#define IPGR (*(volatile unsigned *)0x5000000C)
#define IPGR_OFFSET 0xC
#define IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART2_MASK 0x7F
#define IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART2_BIT 0
#define IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART1_MASK 0x7F00
#define IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART1_BIT 8

