FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1766.h
#define NVIC_IP72 (*(volatile unsigned char *)0xE000E448)
#define NVIC_IP72_OFFSET 0x348

#define NVIC_IP73 (*(volatile unsigned char *)0xE000E449)
#define NVIC_IP73_OFFSET 0x349

#define NVIC_IP74 (*(volatile unsigned char *)0xE000E44A)
#define NVIC_IP74_OFFSET 0x34A

#define NVIC_IP75 (*(volatile unsigned char *)0xE000E44B)
#define NVIC_IP75_OFFSET 0x34B

#define NVIC_IP76 (*(volatile unsigned char *)0xE000E44C)
#define NVIC_IP76_OFFSET 0x34C

#define NVIC_IP77 (*(volatile unsigned char *)0xE000E44D)
#define NVIC_IP77_OFFSET 0x34D

#define NVIC_IP78 (*(volatile unsigned char *)0xE000E44E)
#define NVIC_IP78_OFFSET 0x34E

#define NVIC_IP79 (*(volatile unsigned char *)0xE000E44F)
#define NVIC_IP79_OFFSET 0x34F

#define NVIC_IP80 (*(volatile unsigned char *)0xE000E450)
#define NVIC_IP80_OFFSET 0x350

#define NVIC_IP81 (*(volatile unsigned char *)0xE000E451)
#define NVIC_IP81_OFFSET 0x351

#define NVIC_IP82 (*(volatile unsigned char *)0xE000E452)
#define NVIC_IP82_OFFSET 0x352

#define NVIC_IP83 (*(volatile unsigned char *)0xE000E453)
#define NVIC_IP83_OFFSET 0x353

#define NVIC_IP84 (*(volatile unsigned char *)0xE000E454)
#define NVIC_IP84_OFFSET 0x354

#define NVIC_IP85 (*(volatile unsigned char *)0xE000E455)
#define NVIC_IP85_OFFSET 0x355

#define NVIC_IP86 (*(volatile unsigned char *)0xE000E456)
#define NVIC_IP86_OFFSET 0x356

#define NVIC_IP87 (*(volatile unsigned char *)0xE000E457)
#define NVIC_IP87_OFFSET 0x357

#define NVIC_IP88 (*(volatile unsigned char *)0xE000E458)
#define NVIC_IP88_OFFSET 0x358

#define NVIC_IP89 (*(volatile unsigned char *)0xE000E459)
#define NVIC_IP89_OFFSET 0x359

#define NVIC_IP90 (*(volatile unsigned char *)0xE000E45A)
#define NVIC_IP90_OFFSET 0x35A

#define NVIC_IP91 (*(volatile unsigned char *)0xE000E45B)
#define NVIC_IP91_OFFSET 0x35B

#define NVIC_IP92 (*(volatile unsigned char *)0xE000E45C)
#define NVIC_IP92_OFFSET 0x35C

#define NVIC_IP93 (*(volatile unsigned char *)0xE000E45D)
#define NVIC_IP93_OFFSET 0x35D

#define NVIC_IP94 (*(volatile unsigned char *)0xE000E45E)
#define NVIC_IP94_OFFSET 0x35E

#define NVIC_IP95 (*(volatile unsigned char *)0xE000E45F)
#define NVIC_IP95_OFFSET 0x35F

#define NVIC_IP96 (*(volatile unsigned char *)0xE000E460)
#define NVIC_IP96_OFFSET 0x360

#define NVIC_IP97 (*(volatile unsigned char *)0xE000E461)
#define NVIC_IP97_OFFSET 0x361

#define NVIC_IP98 (*(volatile unsigned char *)0xE000E462)
#define NVIC_IP98_OFFSET 0x362

#define NVIC_IP99 (*(volatile unsigned char *)0xE000E463)
#define NVIC_IP99_OFFSET 0x363

#define NVIC_IP100 (*(volatile unsigned char *)0xE000E464)
#define NVIC_IP100_OFFSET 0x364

#define NVIC_IP101 (*(volatile unsigned char *)0xE000E465)
#define NVIC_IP101_OFFSET 0x365

#define NVIC_IP102 (*(volatile unsigned char *)0xE000E466)
#define NVIC_IP102_OFFSET 0x366

#define NVIC_IP103 (*(volatile unsigned char *)0xE000E467)
#define NVIC_IP103_OFFSET 0x367

#define NVIC_IP104 (*(volatile unsigned char *)0xE000E468)
#define NVIC_IP104_OFFSET 0x368

#define NVIC_IP105 (*(volatile unsigned char *)0xE000E469)
#define NVIC_IP105_OFFSET 0x369

#define NVIC_IP106 (*(volatile unsigned char *)0xE000E46A)
#define NVIC_IP106_OFFSET 0x36A

#define NVIC_IP107 (*(volatile unsigned char *)0xE000E46B)
#define NVIC_IP107_OFFSET 0x36B

#define NVIC_IP108 (*(volatile unsigned char *)0xE000E46C)
#define NVIC_IP108_OFFSET 0x36C

#define NVIC_IP109 (*(volatile unsigned char *)0xE000E46D)
#define NVIC_IP109_OFFSET 0x36D

#define NVIC_IP110 (*(volatile unsigned char *)0xE000E46E)
#define NVIC_IP110_OFFSET 0x36E

#define NVIC_IP111 (*(volatile unsigned char *)0xE000E46F)
#define NVIC_IP111_OFFSET 0x36F

#define NVIC_STIR (*(volatile unsigned *)0xE000EF00)
#define SCB_SW_TRIG NVIC_STIR
#define NVIC_STIR_OFFSET 0xE00
#define SCB_SW_TRIG_OFFSET NVIC_STIR_OFFSET
#define NVIC_STIR_INTID_MASK 0x3FF
#define SCB_SW_TRIG_INTID_MASK NVIC_STIR_INTID_MASK
#define NVIC_STIR_INTID_BIT 0
#define SCB_SW_TRIG_INTID_BIT NVIC_STIR_INTID_BIT

#define SCB_BASE_ADDRESS 0xE000ED00

#define SCB_CPUID (*(volatile unsigned *)0xE000ED00)
#define CPUID_Base SCB_CPUID
#define SCB_CPUID_OFFSET 0x0
#define CPUID_Base_OFFSET SCB_CPUID_OFFSET
#define SCB_CPUID_IMPLEMENTER_MASK 0xFF000000
#define CPUID_Base_IMPLEMENTER_MASK SCB_CPUID_IMPLEMENTER_MASK
#define SCB_CPUID_IMPLEMENTER_BIT 24
#define CPUID_Base_IMPLEMENTER_BIT SCB_CPUID_IMPLEMENTER_BIT
#define SCB_CPUID_VARIANT_MASK 0xF00000
#define CPUID_Base_VARIANT_MASK SCB_CPUID_VARIANT_MASK
#define SCB_CPUID_VARIANT_BIT 20
#define CPUID_Base_VARIANT_BIT SCB_CPUID_VARIANT_BIT
#define SCB_CPUID_PARTNO_MASK 0xFFF0
#define CPUID_Base_PARTNO_MASK SCB_CPUID_PARTNO_MASK
#define SCB_CPUID_PARTNO_BIT 4
#define CPUID_Base_PARTNO_BIT SCB_CPUID_PARTNO_BIT
#define SCB_CPUID_REVISION_MASK 0xF
#define CPUID_Base_REVISION_MASK SCB_CPUID_REVISION_MASK
#define SCB_CPUID_REVISION_BIT 0
#define CPUID_Base_REVISION_BIT SCB_CPUID_REVISION_BIT

#define SCB_ICSR (*(volatile unsigned *)0xE000ED04)
#define Interrupt_Control_State SCB_ICSR
#define SCB_ICSR_OFFSET 0x4
#define Interrupt_Control_State_OFFSET SCB_ICSR_OFFSET
#define SCB_ICSR_NMIPENDSET_MASK 0x80000000
#define Interrupt_Control_State_NMIPENDSET_MASK SCB_ICSR_NMIPENDSET_MASK
#define SCB_ICSR_NMIPENDSET 0x80000000
#define Interrupt_Control_State_NMIPENDSET SCB_ICSR_NMIPENDSET
#define SCB_ICSR_NMIPENDSET_BIT 31
#define Interrupt_Control_State_NMIPENDSET_BIT SCB_ICSR_NMIPENDSET_BIT
#define SCB_ICSR_PENDSVSET_MASK 0x10000000
#define Interrupt_Control_State_PENDSVSET_MASK SCB_ICSR_PENDSVSET_MASK
#define SCB_ICSR_PENDSVSET 0x10000000
#define Interrupt_Control_State_PENDSVSET SCB_ICSR_PENDSVSET
#define SCB_ICSR_PENDSVSET_BIT 28
#define Interrupt_Control_State_PENDSVSET_BIT SCB_ICSR_PENDSVSET_BIT
#define SCB_ICSR_PENDSVCLR_MASK 0x8000000
#define Interrupt_Control_State_PENDSVCLR_MASK SCB_ICSR_PENDSVCLR_MASK
#define SCB_ICSR_PENDSVCLR 0x8000000
#define Interrupt_Control_State_PENDSVCLR SCB_ICSR_PENDSVCLR
#define SCB_ICSR_PENDSVCLR_BIT 27
#define Interrupt_Control_State_PENDSVCLR_BIT SCB_ICSR_PENDSVCLR_BIT
#define SCB_ICSR_PENDSTSET_MASK 0x4000000
#define Interrupt_Control_State_PENDSTSET_MASK SCB_ICSR_PENDSTSET_MASK
#define SCB_ICSR_PENDSTSET 0x4000000
#define Interrupt_Control_State_PENDSTSET SCB_ICSR_PENDSTSET
#define SCB_ICSR_PENDSTSET_BIT 26
#define Interrupt_Control_State_PENDSTSET_BIT SCB_ICSR_PENDSTSET_BIT
#define SCB_ICSR_PENDSTCLR_MASK 0x2000000
#define Interrupt_Control_State_PENDSTCLR_MASK SCB_ICSR_PENDSTCLR_MASK
#define SCB_ICSR_PENDSTCLR 0x2000000
#define Interrupt_Control_State_PENDSTCLR SCB_ICSR_PENDSTCLR
#define SCB_ICSR_PENDSTCLR_BIT 25
#define Interrupt_Control_State_PENDSTCLR_BIT SCB_ICSR_PENDSTCLR_BIT
#define SCB_ICSR_ISRPREEMPT_MASK 0x800000
#define Interrupt_Control_State_ISRPREEMPT_MASK SCB_ICSR_ISRPREEMPT_MASK
#define SCB_ICSR_ISRPREEMPT 0x800000
#define Interrupt_Control_State_ISRPREEMPT SCB_ICSR_ISRPREEMPT
#define SCB_ICSR_ISRPREEMPT_BIT 23
#define Interrupt_Control_State_ISRPREEMPT_BIT SCB_ICSR_ISRPREEMPT_BIT
#define SCB_ICSR_ISRPENDING_MASK 0x400000
#define Interrupt_Control_State_ISRPENDING_MASK SCB_ICSR_ISRPENDING_MASK
#define SCB_ICSR_ISRPENDING 0x400000
#define Interrupt_Control_State_ISRPENDING SCB_ICSR_ISRPENDING
#define SCB_ICSR_ISRPENDING_BIT 22
#define Interrupt_Control_State_ISRPENDING_BIT SCB_ICSR_ISRPENDING_BIT
#define SCB_ICSR_VECTPENDING_MASK 0x1FF000
#define Interrupt_Control_State_VECTPENDING_MASK SCB_ICSR_VECTPENDING_MASK
#define SCB_ICSR_VECTPENDING_BIT 12
#define Interrupt_Control_State_VECTPENDING_BIT SCB_ICSR_VECTPENDING_BIT
#define SCB_ICSR_RETTOBASE_MASK 0x800
#define Interrupt_Control_State_RETTOBASE_MASK SCB_ICSR_RETTOBASE_MASK
#define SCB_ICSR_RETTOBASE 0x800
#define Interrupt_Control_State_RETTOBASE SCB_ICSR_RETTOBASE
#define SCB_ICSR_RETTOBASE_BIT 11
#define Interrupt_Control_State_RETTOBASE_BIT SCB_ICSR_RETTOBASE_BIT
#define SCB_ICSR_VECTACTIVE_MASK 0x1FF
#define Interrupt_Control_State_VECTACTIVE_MASK SCB_ICSR_VECTACTIVE_MASK
#define SCB_ICSR_VECTACTIVE_BIT 0
#define Interrupt_Control_State_VECTACTIVE_BIT SCB_ICSR_VECTACTIVE_BIT

#define SCB_VTOR (*(volatile unsigned *)0xE000ED08)
#define Vector_Table_Offset SCB_VTOR
#define SCB_VTOR_OFFSET 0x8
#define Vector_Table_Offset_OFFSET SCB_VTOR_OFFSET
#define SCB_VTOR_TBLBASE_MASK 0x20000000
#define Vector_Table_Offset_TBLBASE_MASK SCB_VTOR_TBLBASE_MASK
#define SCB_VTOR_TBLBASE 0x20000000
#define Vector_Table_Offset_TBLBASE SCB_VTOR_TBLBASE
#define SCB_VTOR_TBLBASE_BIT 29
#define Vector_Table_Offset_TBLBASE_BIT SCB_VTOR_TBLBASE_BIT
#define SCB_VTOR_TBLOFF_MASK 0x1FFFFF80
#define Vector_Table_Offset_TBLOFF_MASK SCB_VTOR_TBLOFF_MASK
#define SCB_VTOR_TBLOFF_BIT 7
#define Vector_Table_Offset_TBLOFF_BIT SCB_VTOR_TBLOFF_BIT

#define SCB_AIRCR (*(volatile unsigned *)0xE000ED0C)
#define Application_Interrupt_and_Reset_Control SCB_AIRCR
#define SCB_AIRCR_OFFSET 0xC
#define Application_Interrupt_and_Reset_Control_OFFSET SCB_AIRCR_OFFSET
#define SCB_AIRCR_VECTKEY_MASK 0xFFFF0000
#define Application_Interrupt_and_Reset_Control_VECTKEY_MASK SCB_AIRCR_VECTKEY_MASK
#define SCB_AIRCR_VECTKEY_BIT 16
#define Application_Interrupt_and_Reset_Control_VECTKEY_BIT SCB_AIRCR_VECTKEY_BIT
#define SCB_AIRCR_ENDIANESS_MASK 0x8000
#define Application_Interrupt_and_Reset_Control_ENDIANESS_MASK SCB_AIRCR_ENDIANESS_MASK
#define SCB_AIRCR_ENDIANESS 0x8000
#define Application_Interrupt_and_Reset_Control_ENDIANESS SCB_AIRCR_ENDIANESS
#define SCB_AIRCR_ENDIANESS_BIT 15
#define Application_Interrupt_and_Reset_Control_ENDIANESS_BIT SCB_AIRCR_ENDIANESS_BIT
#define SCB_AIRCR_PRIGROUP_MASK 0x700
#define Application_Interrupt_and_Reset_Control_PRIGROUP_MASK SCB_AIRCR_PRIGROUP_MASK
#define SCB_AIRCR_PRIGROUP_BIT 8
#define Application_Interrupt_and_Reset_Control_PRIGROUP_BIT SCB_AIRCR_PRIGROUP_BIT
#define SCB_AIRCR_SYSRESETREQ_MASK 0x4
#define Application_Interrupt_and_Reset_Control_SYSRESETREQ_MASK SCB_AIRCR_SYSRESETREQ_MASK
#define SCB_AIRCR_SYSRESETREQ 0x4
#define Application_Interrupt_and_Reset_Control_SYSRESETREQ SCB_AIRCR_SYSRESETREQ
#define SCB_AIRCR_SYSRESETREQ_BIT 2
#define Application_Interrupt_and_Reset_Control_SYSRESETREQ_BIT SCB_AIRCR_SYSRESETREQ_BIT
#define SCB_AIRCR_VECTCLRACTIVE_MASK 0x2
#define Application_Interrupt_and_Reset_Control_VECTCLRACTIVE_MASK SCB_AIRCR_VECTCLRACTIVE_MASK
#define SCB_AIRCR_VECTCLRACTIVE 0x2
#define Application_Interrupt_and_Reset_Control_VECTCLRACTIVE SCB_AIRCR_VECTCLRACTIVE
#define SCB_AIRCR_VECTCLRACTIVE_BIT 1
#define Application_Interrupt_and_Reset_Control_VECTCLRACTIVE_BIT SCB_AIRCR_VECTCLRACTIVE_BIT
#define SCB_AIRCR_VECTRESET_MASK 0x1
#define Application_Interrupt_and_Reset_Control_VECTRESET_MASK SCB_AIRCR_VECTRESET_MASK
#define SCB_AIRCR_VECTRESET 0x1
#define Application_Interrupt_and_Reset_Control_VECTRESET SCB_AIRCR_VECTRESET
#define SCB_AIRCR_VECTRESET_BIT 0
#define Application_Interrupt_and_Reset_Control_VECTRESET_BIT SCB_AIRCR_VECTRESET_BIT

#define SCB_SCR (*(volatile unsigned *)0xE000ED10)
#define System_Control SCB_SCR
#define SCB_SCR_OFFSET 0x10
#define System_Control_OFFSET SCB_SCR_OFFSET
#define SCB_SCR_SEVONPEND_MASK 0x10
#define System_Control_SEVONPEND_MASK SCB_SCR_SEVONPEND_MASK
#define SCB_SCR_SEVONPEND 0x10
#define System_Control_SEVONPEND SCB_SCR_SEVONPEND
#define SCB_SCR_SEVONPEND_BIT 4
#define System_Control_SEVONPEND_BIT SCB_SCR_SEVONPEND_BIT
#define SCB_SCR_SLEEPDEEP_MASK 0x4
#define System_Control_SLEEPDEEP_MASK SCB_SCR_SLEEPDEEP_MASK
#define SCB_SCR_SLEEPDEEP 0x4
#define System_Control_SLEEPDEEP SCB_SCR_SLEEPDEEP
#define SCB_SCR_SLEEPDEEP_BIT 2
#define System_Control_SLEEPDEEP_BIT SCB_SCR_SLEEPDEEP_BIT
#define SCB_SCR_SLEEPONEXIT_MASK 0x2
#define System_Control_SLEEPONEXIT_MASK SCB_SCR_SLEEPONEXIT_MASK
#define SCB_SCR_SLEEPONEXIT 0x2
#define System_Control_SLEEPONEXIT SCB_SCR_SLEEPONEXIT
#define SCB_SCR_SLEEPONEXIT_BIT 1
#define System_Control_SLEEPONEXIT_BIT SCB_SCR_SLEEPONEXIT_BIT

#define SCB_CCR (*(volatile unsigned *)0xE000ED14)
#define Configuration_Control SCB_CCR
#define SCB_CCR_OFFSET 0x14
#define Configuration_Control_OFFSET SCB_CCR_OFFSET
#define SCB_CCR_STKALIGN_MASK 0x200
#define Configuration_Control_STKALIGN_MASK SCB_CCR_STKALIGN_MASK
#define SCB_CCR_STKALIGN 0x200
#define Configuration_Control_STKALIGN SCB_CCR_STKALIGN
#define SCB_CCR_STKALIGN_BIT 9
#define Configuration_Control_STKALIGN_BIT SCB_CCR_STKALIGN_BIT
#define SCB_CCR_BFHFNMIGN_MASK 0x100
#define Configuration_Control_BFHFNMIGN_MASK SCB_CCR_BFHFNMIGN_MASK
#define SCB_CCR_BFHFNMIGN 0x100
#define Configuration_Control_BFHFNMIGN SCB_CCR_BFHFNMIGN
#define SCB_CCR_BFHFNMIGN_BIT 8
#define Configuration_Control_BFHFNMIGN_BIT SCB_CCR_BFHFNMIGN_BIT
#define SCB_CCR_DIV_0_TRP_MASK 0x10
#define Configuration_Control_DIV_0_TRP_MASK SCB_CCR_DIV_0_TRP_MASK
#define SCB_CCR_DIV_0_TRP 0x10
#define Configuration_Control_DIV_0_TRP SCB_CCR_DIV_0_TRP
#define SCB_CCR_DIV_0_TRP_BIT 4
#define Configuration_Control_DIV_0_TRP_BIT SCB_CCR_DIV_0_TRP_BIT
#define SCB_CCR_UNALIGN_TRP_MASK 0x8
#define Configuration_Control_UNALIGN_TRP_MASK SCB_CCR_UNALIGN_TRP_MASK
#define SCB_CCR_UNALIGN_TRP 0x8
#define Configuration_Control_UNALIGN_TRP SCB_CCR_UNALIGN_TRP
#define SCB_CCR_UNALIGN_TRP_BIT 3
#define Configuration_Control_UNALIGN_TRP_BIT SCB_CCR_UNALIGN_TRP_BIT
#define SCB_CCR_USERSETMPEND_MASK 0x2
#define Configuration_Control_USERSETMPEND_MASK SCB_CCR_USERSETMPEND_MASK
#define SCB_CCR_USERSETMPEND 0x2
#define Configuration_Control_USERSETMPEND SCB_CCR_USERSETMPEND
#define SCB_CCR_USERSETMPEND_BIT 1
#define Configuration_Control_USERSETMPEND_BIT SCB_CCR_USERSETMPEND_BIT
#define SCB_CCR_NONBASETHRDENA_MASK 0x1
#define Configuration_Control_NONBASETHRDENA_MASK SCB_CCR_NONBASETHRDENA_MASK
#define SCB_CCR_NONBASETHRDENA 0x1
#define Configuration_Control_NONBASETHRDENA SCB_CCR_NONBASETHRDENA
#define SCB_CCR_NONBASETHRDENA_BIT 0
#define Configuration_Control_NONBASETHRDENA_BIT SCB_CCR_NONBASETHRDENA_BIT

#define SCB_SHPR1 (*(volatile unsigned *)0xE000ED18)
#define System_Handlers_4_7_Priority SCB_SHPR1
#define SCB_SHPR1_OFFSET 0x18
#define System_Handlers_4_7_Priority_OFFSET SCB_SHPR1_OFFSET
#define SCB_SHPR1_PRI_4_MASK 0xFF
#define System_Handlers_4_7_Priority_PRI_4_MASK SCB_SHPR1_PRI_4_MASK
#define SCB_SHPR1_PRI_4_BIT 0
#define System_Handlers_4_7_Priority_PRI_4_BIT SCB_SHPR1_PRI_4_BIT
#define SCB_SHPR1_PRI_5_MASK 0xFF00
#define System_Handlers_4_7_Priority_PRI_5_MASK SCB_SHPR1_PRI_5_MASK
#define SCB_SHPR1_PRI_5_BIT 8
#define System_Handlers_4_7_Priority_PRI_5_BIT SCB_SHPR1_PRI_5_BIT
#define SCB_SHPR1_PRI_6_MASK 0xFF0000
#define System_Handlers_4_7_Priority_PRI_6_MASK SCB_SHPR1_PRI_6_MASK
#define SCB_SHPR1_PRI_6_BIT 16
#define System_Handlers_4_7_Priority_PRI_6_BIT SCB_SHPR1_PRI_6_BIT
#define SCB_SHPR1_PRI_7_MASK 0xFF000000
#define System_Handlers_4_7_Priority_PRI_7_MASK SCB_SHPR1_PRI_7_MASK
#define SCB_SHPR1_PRI_7_BIT 24
#define System_Handlers_4_7_Priority_PRI_7_BIT SCB_SHPR1_PRI_7_BIT

#define SCB_SHPR2 (*(volatile unsigned *)0xE000ED1C)
#define System_Handlers_8_11_Priority SCB_SHPR2
#define SCB_SHPR2_OFFSET 0x1C
#define System_Handlers_8_11_Priority_OFFSET SCB_SHPR2_OFFSET
#define SCB_SHPR2_PRI_8_MASK 0xFF
#define System_Handlers_8_11_Priority_PRI_8_MASK SCB_SHPR2_PRI_8_MASK
#define SCB_SHPR2_PRI_8_BIT 0
#define System_Handlers_8_11_Priority_PRI_8_BIT SCB_SHPR2_PRI_8_BIT
#define SCB_SHPR2_PRI_9_MASK 0xFF00
#define System_Handlers_8_11_Priority_PRI_9_MASK SCB_SHPR2_PRI_9_MASK
#define SCB_SHPR2_PRI_9_BIT 8
#define System_Handlers_8_11_Priority_PRI_9_BIT SCB_SHPR2_PRI_9_BIT
#define SCB_SHPR2_PRI_10_MASK 0xFF0000
#define System_Handlers_8_11_Priority_PRI_10_MASK SCB_SHPR2_PRI_10_MASK
#define SCB_SHPR2_PRI_10_BIT 16
#define System_Handlers_8_11_Priority_PRI_10_BIT SCB_SHPR2_PRI_10_BIT
#define SCB_SHPR2_PRI_11_MASK 0xFF000000
#define System_Handlers_8_11_Priority_PRI_11_MASK SCB_SHPR2_PRI_11_MASK
#define SCB_SHPR2_PRI_11_BIT 24
#define System_Handlers_8_11_Priority_PRI_11_BIT SCB_SHPR2_PRI_11_BIT

